export const totalMembers = ['이', '박', '최', '정', '이2', '최2'];

export const mock_group_data_list = [
  {
    id: '1',
    schedule: [
      {
        from: '2023-12-27 12:00:00',
        to: '2023-12-27 12:00:00',
        group: { name: '그룹1', members: ['이', '박'] },
      },
      {
        from: '2023-12-27 12:00:00',
        to: '2023-12-27 12:00:00',
        group: { name: '그룹2', members: ['정', '최'] },
      },
      {
        from: '2023-12-27 12:00:00',
        to: '2023-12-27 12:00:00',
        group: { name: '그룹3', members: ['이2', '최2'] },
      },
    ],
  },
  {
    id: '2',
    schedule: [
      {
        from: '2023-12-27 12:00:00',
        to: '2023-12-27 12:00:00',
        group: { name: '그룹1', members: ['이', '박'] },
      },
      {
        from: '2023-12-27 12:00:00',
        to: '2023-12-27 12:00:00',
        group: { name: '그룹2', members: ['이', '최'] },
      },
      {
        from: '2023-12-27 12:00:00',
        to: '2023-12-27 12:00:00',
        group: { name: '그룹3', members: ['이', '최'] },
      },
    ],
  },
  {
    id: '3',
    schedule: [
      {
        from: '2023-12-27 12:00:00',
        to: '2023-12-27 12:00:00',
        group: { name: '그룹1', members: ['이', '박'] },
      },
      {
        from: '2023-12-27 12:00:00',
        to: '2023-12-27 12:00:00',
        group: { name: '그룹2', members: ['이2', '최'] },
      },
    ],
  },
  {
    id: '4',
    schedule: [
      {
        from: '2023-12-27 12:00:00',
        to: '2023-12-27 12:00:00',
        group: { name: '그룹1', members: ['이', '박'] },
      },
      {
        from: '2023-12-27 12:00:00',
        to: '2023-12-27 12:00:00',
        group: { name: '그룹2', members: ['이', '최'] },
      },
    ],
  },
  {
    id: '5',
    schedule: [
      {
        from: '2023-12-27 12:00:00',
        to: '2023-12-27 12:00:00',
        group: { name: '그룹1', members: ['이', '박', '최'] },
      },
    ],
  },
];

export const mock_single_data_list = [
  { id: '1', time: '2023-12-27 12:00:00', members: ['손', '이', '박'] },
  { id: '2', time: '2023-12-27 11:00:00', members: ['손', '이', '박'] },
  { id: '3', time: '2023-12-27 10:00:00', members: ['손', '이', '박'] },
  { id: '4', time: '2023-12-27 13:00:00', members: ['손', '이', '박'] },
  { id: '5', time: '2023-12-27 14:00:00', members: ['손', '이', '박'] },
  { id: '6', time: '2023-12-27 15:00:00', members: ['손', '이', '박'] },
  { id: '7', time: '2023-12-27 16:00:00', members: ['손', '이', '박'] },
  { id: '8', time: '2023-12-27 11:30:00', members: ['손', '이', '박'] },
  { id: '9', time: '2023-12-27 12:30:00', members: ['손', '이', '박'] },
  { id: '10', time: '2023-12-27 15:30:00', members: ['손', '이', '박'] },
];
